import AccessibilityButton from "@/components/Accessibility";
import ImageScroll from "@/components/ImageScroll";
import { useApp } from "@/context/AppContext";
import { Inter } from "next/font/google";
import Image from "next/image";
import Link from "next/link";

const inter = Inter({ subsets: ["latin"] });

export default function Home() {
 const {enlargeFont} = useApp()

  return (
    <>
      <div className="relative text-center">
        <AccessibilityButton />
        <main className="bg-cover max-h-screen main-header ">
          <div className="absolute top-[110px] transform -translate-x-1/2 left-1/2  ">
            <h1 className={`${enlargeFont ? 'text-4xl' : 'text-3xl'} font-extrabold`}>ПРОМЕНАТА ДОАЃА</h1>
            <h1 className={`${enlargeFont ? 'text-4xl' : 'text-3xl'} font-extrabold`}>ОД МЛАДИТЕ</h1>
            <div className="mt-[120px]">
              <h1 className="text-2xl font-bold">Кои сме ние?</h1>
            </div>
            <div className="w-[480px] text-center">
              <p>
                Центарот за младински активизам Крик е невладина, непрофитна
                организација основана од млади луѓе, предводена од млади луѓе и
                работи за и со млади луѓе.
              </p>
            </div>
            <div className="mt-[40px]">
              <button
                type="button"
                className="w-80 bg-purpleColor font-extrabold rounded-3xl text-xl px-[30px] py-[16px] text-center dark:border-gray-900 dark:text-black"
              >
                Повеќе за Нас
              </button>
            </div>
          </div>
        </main>
      </div>
      <div className="flex mx-auto w-4/5 bg-blackColor pb-[10px] rounded-2xl relative top-[-160px] ">
        <div className="w-1/2 px-5">
          <div className="mt-[68px] ">
            <h1 className="text-2xl text-yellowColor">НАСКОРО</h1>
            <h1 className="text-white text-l mt-[24px] ">Нижеме заедно</h1>
            <p className="text-white mt-[24px] ">
              Проектот „Еднакви можности за девојчињата и младите жени во
              Северна Македонија” го спроведуваат Националниот младински совет
              на Македонија и Stella Network, со финансиска поддршка од страна
              на Британската амбасада во Скопје
            </p>
            <div className="flex flex-row gap-[15px] mt-[20px]">
              <button>
                <svg
                  width="140"
                  height="32"
                  viewBox="0 0 289 64"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <rect width="289" height="64" rx="30" fill="#FBB13C" />
                  <path
                    d="M68.6181 41V24.08H76.0341C77.8741 24.08 79.2901 24.472 80.2821 25.256C81.2741 26.024 81.7701 27.096 81.7701 28.472C81.7701 29.496 81.4661 30.36 80.8581 31.064C80.2501 31.768 79.4101 32.24 78.3381 32.48V32.12C79.5701 32.296 80.5221 32.744 81.1941 33.464C81.8821 34.168 82.2261 35.104 82.2261 36.272C82.2261 37.776 81.7061 38.944 80.6661 39.776C79.6261 40.592 78.1781 41 76.3221 41H68.6181ZM71.5941 38.648H75.9621C77.0021 38.648 77.8101 38.456 78.3861 38.072C78.9621 37.672 79.2501 37.024 79.2501 36.128C79.2501 35.216 78.9621 34.568 78.3861 34.184C77.8101 33.784 77.0021 33.584 75.9621 33.584H71.5941V38.648ZM71.5941 31.256H75.5061C76.6101 31.256 77.4261 31.056 77.9541 30.656C78.4981 30.24 78.7701 29.632 78.7701 28.832C78.7701 28.032 78.4981 27.432 77.9541 27.032C77.4261 26.616 76.6101 26.408 75.5061 26.408H71.5941V31.256ZM85.0204 41V28.88H87.7324V38.048H87.0124L93.9004 28.88H96.3724V41H93.6604V31.808H94.4044L87.4924 41H85.0204ZM98.706 44.12V38.72H100.098C100.578 37.968 100.922 37.088 101.13 36.08C101.354 35.056 101.466 33.808 101.466 32.336V28.88H110.802V38.72H112.77V44.12H110.226V41H101.25V44.12H98.706ZM102.786 38.744H107.994V31.136H104.01V33.008C104.01 34.08 103.906 35.128 103.698 36.152C103.49 37.176 103.186 38.04 102.786 38.744ZM114.974 41V28.88H117.686V38.048H116.966L123.854 28.88H126.326V41H123.614V31.808H124.358L117.446 41H114.974ZM136.493 41V24.08H151.301V41H148.229V26.6H139.541V41H136.493ZM160.432 41.24C159.184 41.24 158.104 40.984 157.192 40.472C156.28 39.96 155.568 39.232 155.056 38.288C154.56 37.344 154.312 36.224 154.312 34.928C154.312 33.632 154.56 32.52 155.056 31.592C155.568 30.648 156.28 29.92 157.192 29.408C158.104 28.896 159.184 28.64 160.432 28.64C161.68 28.64 162.76 28.896 163.672 29.408C164.6 29.92 165.312 30.648 165.808 31.592C166.32 32.52 166.576 33.632 166.576 34.928C166.576 36.224 166.32 37.344 165.808 38.288C165.312 39.232 164.6 39.96 163.672 40.472C162.76 40.984 161.68 41.24 160.432 41.24ZM160.432 38.936C161.376 38.936 162.128 38.608 162.688 37.952C163.248 37.28 163.528 36.272 163.528 34.928C163.528 33.584 163.248 32.584 162.688 31.928C162.128 31.272 161.376 30.944 160.432 30.944C159.488 30.944 158.736 31.272 158.176 31.928C157.616 32.584 157.336 33.584 157.336 34.928C157.336 36.272 157.616 37.28 158.176 37.952C158.736 38.608 159.488 38.936 160.432 38.936ZM169.419 41V28.88H175.875C177.395 28.88 178.507 29.16 179.211 29.72C179.915 30.264 180.267 31.04 180.267 32.048C180.267 32.816 180.011 33.456 179.499 33.968C178.987 34.48 178.307 34.8 177.459 34.928V34.592C178.499 34.656 179.299 34.96 179.859 35.504C180.419 36.048 180.699 36.752 180.699 37.616C180.699 38.656 180.299 39.48 179.499 40.088C178.699 40.696 177.563 41 176.091 41H169.419ZM172.203 39.152H175.779C176.483 39.152 177.019 39.008 177.387 38.72C177.771 38.432 177.963 38.008 177.963 37.448C177.963 36.888 177.771 36.464 177.387 36.176C177.019 35.888 176.483 35.744 175.779 35.744H172.203V39.152ZM172.203 33.896H175.515C176.155 33.896 176.651 33.76 177.003 33.488C177.355 33.2 177.531 32.8 177.531 32.288C177.531 31.776 177.355 31.384 177.003 31.112C176.651 30.84 176.155 30.704 175.515 30.704H172.203V33.896ZM189.269 41.24C187.237 41.24 185.645 40.68 184.493 39.56C183.341 38.44 182.765 36.904 182.765 34.952C182.765 33.688 183.013 32.584 183.509 31.64C184.005 30.696 184.693 29.96 185.573 29.432C186.469 28.904 187.509 28.64 188.693 28.64C189.861 28.64 190.837 28.888 191.621 29.384C192.405 29.88 192.997 30.576 193.397 31.472C193.813 32.368 194.021 33.416 194.021 34.616V35.408H185.189V33.824H191.885L191.477 34.16C191.477 33.04 191.237 32.184 190.757 31.592C190.293 31 189.613 30.704 188.717 30.704C187.725 30.704 186.957 31.056 186.413 31.76C185.885 32.464 185.621 33.448 185.621 34.712V35.024C185.621 36.336 185.941 37.32 186.581 37.976C187.237 38.616 188.157 38.936 189.341 38.936C190.029 38.936 190.669 38.848 191.261 38.672C191.869 38.48 192.445 38.176 192.989 37.76L193.877 39.776C193.301 40.24 192.613 40.6 191.813 40.856C191.013 41.112 190.165 41.24 189.269 41.24ZM196.794 41V28.88H199.77V33.632H201.594L205.146 28.88H208.362L203.898 34.928L203.25 33.992C203.698 34.04 204.09 34.16 204.426 34.352C204.778 34.544 205.106 34.816 205.41 35.168C205.73 35.504 206.042 35.936 206.346 36.464L208.89 41H205.698L203.634 37.352C203.426 36.984 203.218 36.696 203.01 36.488C202.802 36.28 202.57 36.136 202.314 36.056C202.058 35.976 201.746 35.936 201.378 35.936H199.77V41H196.794ZM201.57 27.704L204.042 22.832H206.994L203.586 27.704H201.57ZM216.433 41.24C214.401 41.24 212.809 40.68 211.657 39.56C210.505 38.44 209.929 36.904 209.929 34.952C209.929 33.688 210.177 32.584 210.673 31.64C211.169 30.696 211.857 29.96 212.737 29.432C213.633 28.904 214.673 28.64 215.857 28.64C217.025 28.64 218.001 28.888 218.785 29.384C219.569 29.88 220.161 30.576 220.561 31.472C220.977 32.368 221.185 33.416 221.185 34.616V35.408H212.353V33.824H219.049L218.641 34.16C218.641 33.04 218.401 32.184 217.921 31.592C217.457 31 216.777 30.704 215.881 30.704C214.889 30.704 214.121 31.056 213.577 31.76C213.049 32.464 212.785 33.448 212.785 34.712V35.024C212.785 36.336 213.105 37.32 213.745 37.976C214.401 38.616 215.321 38.936 216.505 38.936C217.193 38.936 217.833 38.848 218.425 38.672C219.033 38.48 219.609 38.176 220.153 37.76L221.041 39.776C220.465 40.24 219.777 40.6 218.977 40.856C218.177 41.112 217.329 41.24 216.433 41.24Z"
                    fill="#191919"
                  />
                </svg>
              </button>
              <button>
                <svg
                  width="140"
                  height="32"
                  viewBox="0 0 289 64"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <rect width="289" height="64" rx="30" fill="#B8AFDA" />
                  <path
                    d="M77.6533 41V24.08H92.4613V41H89.3893V26.6H80.7013V41H77.6533ZM96.1203 46.184V31.904C96.1203 31.408 96.1043 30.904 96.0723 30.392C96.0403 29.88 95.9923 29.376 95.9283 28.88H98.8323L99.0963 31.424H98.8323C99.0723 30.576 99.5763 29.904 100.344 29.408C101.128 28.896 102.032 28.64 103.056 28.64C104.128 28.64 105.064 28.896 105.864 29.408C106.664 29.904 107.288 30.624 107.736 31.568C108.184 32.496 108.408 33.616 108.408 34.928C108.408 36.24 108.184 37.368 107.736 38.312C107.288 39.256 106.664 39.984 105.864 40.496C105.064 40.992 104.128 41.24 103.056 41.24C102.048 41.24 101.16 40.992 100.392 40.496C99.6243 40 99.1123 39.336 98.8563 38.504H99.1203V46.184H96.1203ZM102.216 38.936C103.176 38.936 103.944 38.608 104.52 37.952C105.096 37.28 105.384 36.272 105.384 34.928C105.384 33.584 105.096 32.584 104.52 31.928C103.944 31.272 103.176 30.944 102.216 30.944C101.272 30.944 100.512 31.272 99.9363 31.928C99.3603 32.584 99.0723 33.584 99.0723 34.928C99.0723 36.272 99.3603 37.28 99.9363 37.952C100.512 38.608 101.272 38.936 102.216 38.936ZM111.235 41V28.88H113.947V38.048H113.227L120.115 28.88H122.587V41H119.875V31.808H120.619L113.707 41H111.235ZM124.897 46.328C124.593 46.328 124.265 46.304 123.913 46.256C123.545 46.208 123.225 46.128 122.953 46.016V43.64C123.161 43.704 123.385 43.76 123.625 43.808C123.865 43.856 124.097 43.88 124.321 43.88C124.897 43.88 125.345 43.704 125.665 43.352C126.001 43 126.169 42.408 126.169 41.576V28.88H129.169V41.744C129.169 43.248 128.825 44.384 128.137 45.152C127.449 45.936 126.369 46.328 124.897 46.328ZM125.977 26.6V23.672H129.313V26.6H125.977ZM137.386 41.24C136.33 41.24 135.402 40.992 134.602 40.496C133.802 39.984 133.178 39.256 132.73 38.312C132.282 37.368 132.058 36.24 132.058 34.928C132.058 33.616 132.282 32.496 132.73 31.568C133.178 30.624 133.802 29.904 134.602 29.408C135.402 28.896 136.33 28.64 137.386 28.64C138.41 28.64 139.306 28.896 140.074 29.408C140.858 29.904 141.378 30.576 141.634 31.424H141.37L141.634 28.88H144.514C144.466 29.376 144.418 29.88 144.37 30.392C144.338 30.904 144.322 31.408 144.322 31.904V41H141.346L141.322 38.504H141.61C141.354 39.336 140.834 40 140.05 40.496C139.266 40.992 138.378 41.24 137.386 41.24ZM138.226 38.936C139.17 38.936 139.93 38.608 140.506 37.952C141.082 37.28 141.37 36.272 141.37 34.928C141.37 33.584 141.082 32.584 140.506 31.928C139.93 31.272 139.17 30.944 138.226 30.944C137.282 30.944 136.522 31.272 135.946 31.928C135.37 32.584 135.082 33.584 135.082 34.928C135.082 36.272 135.362 37.28 135.922 37.952C136.498 38.608 137.266 38.936 138.226 38.936ZM147.821 41V28.88H154.277C155.797 28.88 156.909 29.16 157.613 29.72C158.317 30.264 158.669 31.04 158.669 32.048C158.669 32.816 158.413 33.456 157.901 33.968C157.389 34.48 156.709 34.8 155.861 34.928V34.592C156.901 34.656 157.701 34.96 158.261 35.504C158.821 36.048 159.101 36.752 159.101 37.616C159.101 38.656 158.701 39.48 157.901 40.088C157.101 40.696 155.965 41 154.493 41H147.821ZM150.605 39.152H154.181C154.885 39.152 155.421 39.008 155.789 38.72C156.173 38.432 156.365 38.008 156.365 37.448C156.365 36.888 156.173 36.464 155.789 36.176C155.421 35.888 154.885 35.744 154.181 35.744H150.605V39.152ZM150.605 33.896H153.917C154.557 33.896 155.053 33.76 155.405 33.488C155.757 33.2 155.933 32.8 155.933 32.288C155.933 31.776 155.757 31.384 155.405 31.112C155.053 30.84 154.557 30.704 153.917 30.704H150.605V33.896ZM161.72 41V28.88H164.432V38.048H163.712L170.6 28.88H173.072V41H170.36V31.808H171.104L164.192 41H161.72ZM188.735 41.24C187.487 41.24 186.391 40.984 185.447 40.472C184.519 39.96 183.799 39.232 183.287 38.288C182.775 37.328 182.519 36.192 182.519 34.88C182.519 33.568 182.775 32.448 183.287 31.52C183.815 30.592 184.543 29.88 185.471 29.384C186.399 28.888 187.487 28.64 188.735 28.64C189.535 28.64 190.311 28.768 191.063 29.024C191.831 29.264 192.455 29.616 192.935 30.08L192.023 32.168C191.591 31.768 191.103 31.472 190.559 31.28C190.031 31.072 189.511 30.968 188.999 30.968C187.927 30.968 187.087 31.304 186.479 31.976C185.887 32.648 185.591 33.624 185.591 34.904C185.591 36.184 185.887 37.168 186.479 37.856C187.087 38.544 187.927 38.888 188.999 38.888C189.495 38.888 190.007 38.792 190.535 38.6C191.079 38.408 191.575 38.112 192.023 37.712L192.935 39.776C192.439 40.24 191.807 40.6 191.039 40.856C190.287 41.112 189.519 41.24 188.735 41.24ZM201.445 41.24C199.413 41.24 197.821 40.68 196.669 39.56C195.517 38.44 194.941 36.904 194.941 34.952C194.941 33.688 195.189 32.584 195.685 31.64C196.181 30.696 196.869 29.96 197.749 29.432C198.645 28.904 199.685 28.64 200.869 28.64C202.037 28.64 203.013 28.888 203.797 29.384C204.581 29.88 205.173 30.576 205.573 31.472C205.989 32.368 206.197 33.416 206.197 34.616V35.408H197.365V33.824H204.061L203.653 34.16C203.653 33.04 203.413 32.184 202.933 31.592C202.469 31 201.789 30.704 200.893 30.704C199.901 30.704 199.133 31.056 198.589 31.76C198.061 32.464 197.797 33.448 197.797 34.712V35.024C197.797 36.336 198.117 37.32 198.757 37.976C199.413 38.616 200.333 38.936 201.517 38.936C202.205 38.936 202.845 38.848 203.437 38.672C204.045 38.48 204.621 38.176 205.165 37.76L206.053 39.776C205.477 40.24 204.789 40.6 203.989 40.856C203.189 41.112 202.341 41.24 201.445 41.24ZM209.33 35.984L208.394 24.08H212.09L211.154 35.984H209.33ZM208.562 41V37.664H211.922V41H208.562Z"
                    fill="#191919"
                  />
                </svg>
              </button>
            </div>
          </div>
        </div>
        <div className="w-1/2">
          <Image src="/homepage/homepage_nastan_750x655px.jpg" alt="" />
        </div>
      </div>
      <hr className="my-6 border-gray-900 sm:mx-auto dark:border-gray-900 lg:my-8" />
      <div className="flex mx-auto my-8 w-3/4 my-6 ">
        <div className="w-4/12 text-center  ">
          <h2 className="text-5xl font-extrabold text-orangeColor">320+</h2>
          <h2 className="text-xl text-orangeColor">Проекти</h2>
        </div>

        <div className="w-4/12 text-center">
          <h2 className="text-5xl font-extrabold text-orangeColor">580+</h2>
          <h2 className="text-xl  text-orangeColor">Волонтери</h2>
        </div>

        <div className="w-4/12 text-center ">
          <h2 className="text-5xl font-extrabold text-orangeColor">25+</h2>
          <h2 className="text-xl text-orangeColor">Партнери</h2>
        </div>
      </div>
      <hr className="my-6 border-gray-900 sm:mx-auto dark:border-gray-900 lg:my-8" />

      <div className="mx-auto w-4/5 flex my-5">
        <div className="w-4/6  mr-[10px] ">
          <img className="rounded-2xl" src="/icons/image 22.png" alt="" />
        </div>
        <div className="w-2/6 bg-blackColor rounded-2xl px-5">
          <h1 className="text-2xl text-white font-bold mt-[48px]">Стани</h1>
          <h1 className="text-white text-xl font-bold">Волонтер</h1>
          <p className="text-white mt-[72px] ">
            Сакаш да работиш со млади лица? Оваа можност е токму за тебе.
          </p>
          <div className="mt-[84px]">
            <Link href={"/volunteers-app"}>
              <button
                type="button"
                className=" hover:text-white border border-gray-800  font-medium rounded-2xl text-sm px-[40px] py-[10px] text-center me-2 mb-2 dark:border-white dark:text-white"
              >
                Придружи ни Се
              </button>
            </Link>
          </div>
        </div>
      </div>

      <div className="mx-auto w-4/5 mt-[140px]">
        <h1 className="text-4xl font-extrabold px-5">Најнови вести</h1>
        <div className="container mx-auto mt-8">
      <ImageScroll />
    </div>
      </div>

      <div className="mx-auto w-4/5 mt-[70px]">
        <div className="flex flex-row justify-end ">
          <button
            type="button"
            className=" bg-purpleColor  font-extrabold rounded-3xl text-xl px-[15px] py-[10px] text-center dark:border-gray-900 dark:text-black"
          >
            Види За Цел Месец
          </button>
        </div>
      </div>
      <div className="mx-auto w-4/5 mt-[70px]">
        <h1 className=" text-4xl font-extrabold px-5">Нашите услуги</h1>
      </div>
      <div className="flex mx-auto my-8 w-4/5">
        <div className="w-1/2 px-5">
          <img
            className="filter grayscale w-[748px] h-[608px] rounded-2xl"
            src="/homepage/homepage_uslugi_cardimg.jpg"
            alt=""
          />
        </div>
        <div className="w-1/2">
          <div className="flex items-center justify-between ">
            <h1 className="font-bold text-3xl pb-2 text-left">
              01 Мултифункционален центар Крикни
            </h1>
            <svg
              className="ml-[35px]"
              width="51"
              height="51"
              viewBox="0 0 51 51"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <rect width="51" height="51" rx="25.5" fill="#191919" />
              <path
                d="M17.8813 34.1667L32.9473 19M32.9473 19V33.56M32.9473 19H18.484"
                stroke="white"
                stroke-width="2"
                stroke-linecap="square"
              />
            </svg>
          </div>

          <p>
            Lorem ipsum dolor sit amet consectetur. Non at at risus dolor
            accumsan vitae dignissim. Est dapibus turpis metus ac rhoncus tellus
            volutpat.
          </p>
          <hr className="my-6 border-gray-900 sm:mx-auto dark:border-gray-900 lg:my-8" />

          <div className="flex items-center justify-between">
            <h1 className="font-bold text-3xl pb-2 text-left">
              02 Независни станбени единици
            </h1>
            <svg
              className="ml-[35px]"
              width="51"
              height="51"
              viewBox="0 0 51 51"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <rect width="51" height="51" rx="25.5" fill="#FB5E3C" />
              <path
                d="M17.8813 34.1667L32.9473 19M32.9473 19V33.56M32.9473 19H18.484"
                stroke="white"
                stroke-width="2"
                stroke-linecap="square"
              />
            </svg>
          </div>

          <p>
            Lorem ipsum dolor sit amet consectetur. Non at at risus dolor
            accumsan vitae dignissim. Est dapibus turpis metus ac rhoncus tellus
            volutpat.
          </p>
          <hr className="my-6 border-gray-900 sm:mx-auto dark:border-gray-900 lg:my-8" />

          <div className="flex items-center justify-between">
            <h1 className="font-bold text-3xl pb-2 text-left">
              03 советувалиште за Млади и Родители
            </h1>

            <div className="flex flex-row justify-end">
              <svg
                width="51"
                height="51"
                viewBox="0 0 51 51"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <rect width="51" height="51" rx="25.5" fill="#FB5E3C" />
                <path
                  d="M17.8813 34.1667L32.9473 19M32.9473 19V33.56M32.9473 19H18.484"
                  stroke="white"
                  stroke-width="2"
                  stroke-linecap="square"
                />
              </svg>
            </div>
          </div>

          <p>
            Lorem ipsum dolor sit amet consectetur. Non at at risus dolor
            accumsan vitae dignissim. Est dapibus turpis metus ac rhoncus tellus
            volutpat.
          </p>
          <hr className="my-6 border-gray-900 sm:mx-auto dark:border-gray-900 lg:my-8" />
        </div>
      </div>
      <div className="mx-auto w-4/5 mt-[70px] mb-[54px]">
        <h1 className=" text-4xl font-extrabold px-5">Партнери</h1>
      </div>
      <hr className="my-6 border-gray-900 sm:mx-auto dark:border-gray-900 lg:my-8" />
      <div className=" mx-auto w-4/5 flex items-center space-x-8">
        <div className="w-1/4">
          <img src="/icons/VCS 1.png" alt="" />
        </div>
        <div className="w-1/4">
          <img src="/icons/Frame 92.png" alt="" />
        </div>
        <div className="w-1/4">
          <img src="/icons/nmsmakedonija 1.png" alt="" />
        </div>
        <div className="w-1/4 ">
          <img src="/icons/stella-network 2.png" alt="" />
        </div>
      </div>

      <hr className="my-6 border-gray-900 sm:mx-auto dark:border-gray-900 lg:my-8" />
    </>
  );
}
